package yandex.contest2023fall50496

import yandex.INPUT_FILE
import yandex.OUTPUT_FILE
import yandex.readFile
import yandex.writeFile

/**
 * F. Села батарейка
 *
 *
 * Производители телефонов стараются заботиться о наилучшем пользовательском опыте. Для того чтобы телефон выполнял
 * свои функции, в нем постоянно должны быть активны n приложений. Одним из важных показателей является то, сколько
 * часов телефон сможет работать. Экспериментальным путем для каждого приложения было выяснено, сколько процентов
 * батареи оно тратит в час. Помогите рассчитать, сколько полных часов будет функционировать телефон, если
 * постоянно будут запущены все приложения.
 *
 * Формат ввода
 * В первой строке содержится целое число n - количество стандартных приложений(1 ≤ n ≤ 10^5). В следующей строке
 * содержится ровно n целых чисел a(i) - из которых обозначает сколько процентов батареи съедает приложение в
 * час 1 ≤ a(i) ≤ 100.
 *
 * Формат вывода
 * В единственной строке выведите одно целое число, обозначающее количество полных часов которые выдержит батарея.
 * Изначально батарея заряжена на все 100
 *
 * Пример
 * Ввод
 * 3
 * 1 4 5
 *
 * Вывод
 * 10
 */

fun main(args: Array<String>) {
    lowBattery()
}

fun lowBattery(){
    //OK - 407ms - все тесты пройдены

    val appPercents = readFile(INPUT_FILE)[1].split(" ")
    var sum = 0

    appPercents.forEach {
        sum += it.toInt()
    }

    val answer = 100 / sum

    writeFile(answer.toString(), OUTPUT_FILE)
}